backend/controllers/AdminController.php

SELECT * FROM `admin` WHERE `id`='4'
---
    protected function findModel($id) {
        if (($model = Admin::findOne($id)) !== null) {