backend.old/services/permission/Impl/PermissionServiceImpl.php

SELECT `typename`, GROUP_CONCAT(description) AS description, GROUP_CONCAT(name) AS name FROM `auth_item` WHERE `type`=2 GROUP BY `typename`
---
    public function permissionGroupByTypeName()
    {
        return AuthItem::find()->select(['typename', 'GROUP_CONCAT(description) AS description', 'GROUP_CONCAT(name) AS name'])
                        ->where(['type' => 2])->groupBy('typename')
                        ->asArray()
                        ->all();

SELECT * FROM `auth_item` WHERE `type`=2
---
    public function queryAllPermission($params = [])
    {
        return AuthItem::find()->where($params)
                        ->asArray()
                        ->all();