backend/models/PermissionForm.php

INSERT INTO `auth_item` (`name`, `type`, `description`, `typename`) VALUES (NULL, 2, NULL, NULL)
---
    public function addPermission()
    {

//        echo "222";
//        die;
        $authItem = new AuthItem();
        $authItem->name = $this->name;
        $authItem->type = $this->type;
        $authItem->description = $this->description;
        $authItem->typename = $this->typename;
        $authItem->save();