backend/models/SignupForm.php

    public function signup() {
        if (!$this->validate()) {
            return null;
        }

        $user = new Admin();
        $user->username = $this->username;

        $user->email = $this->email;

        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->save();
---
INSERT INTO `admin` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('test1', 'imis@ioutsider.me', '$2y$13$r4X2aNcF8PMXsuPWtRIhSedJv2snOUxUv14LHKRxr9q/n7CYbPGMu', 'U8VtHDjPhlPEt8p4OKi8bQ9jJiG4m7o6', 10, 1536234912, 1536234912)