backend.old/services/role/Impl/RoleServiceImpl.php

    public function queryAllRoleByWhere($params = [])
    {
        return AuthItem::find()->where($params)
                        ->asArray()
                        ->all();
---
SELECT * FROM `auth_item` WHERE `type`=1